
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РабочееВремяСотрудников 
	Движения.РабочееВремяСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаГрафикРаботы Из ГрафикРаботы Цикл
		Движение = Движения.РабочееВремяСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаГрафикРаботы.Сотрудник;
		Движение.Должность = ТекСтрокаГрафикРаботы.Должность;
		Движение.Период = Период;
		Движение.РабочихДнейФакт = ТекСтрокаГрафикРаботы.КоличествоРабочихДней;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
