
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Претензии 
	Движения.Претензии.Записывать = Истина;
	Движение = Движения.Претензии.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Движение.Статус = Статус;
	Движение.Описание = ОписаниеПретензии;
	Движение.Количество = 1;
	Движение.Мастер = ВиновныйСотрудник;
	Движение.Клиент = Клиент;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
