// ++ SMPlekhanov@1bit.com 23.03.2024 [Самообучение]
// Обрабатывает изменение флажка "По производственному календарю".
// Делает поля "Дней работы" и "Дней отдыха" доступными или недоступными в зависимости от его значения.
&НаКлиенте
Процедура ПоПроизводственномуКалендарюПриИзменении(Элемент)
	Элементы.ДнейРаботы.Доступность = Не Объект.ПоПроизводственномуКалендарю;
	Элементы.ДнейОтдыха.Доступность = Не Объект.ПоПроизводственномуКалендарю;
КонецПроцедуры

// Выполняет проверку заполненности полей "Дней работы" и "Дней отдыха" перед записью объекта,
// если поля доступны для редактирования. В случае незаполненности хотя бы одного из полей
// выводит соответствующее сообщение и блокирует запись.
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Элементы.ДнейРаботы.Доступность Тогда
		Если Не ЗначениеЗаполнено(Объект.ДнейРаботы) Тогда
			Сообщить("Заполните количество дней работы.");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ДнейОтдыха) Тогда
			Сообщить("Заполните количество дней отдыха.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
// -- SMPlekhanov@1bit.com 23.03.2024 [Самообучение]
