
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПерсональнаяСкидка 
	Движения.ПерсональнаяСкидка.Записывать = Истина;
	Движение = Движения.ПерсональнаяСкидка.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата;
	Движение.Клиент = Клиент;
	Движение.ПериодПредоставления = ПериодПредоставленияДо;
	Движение.Статус = Статус;
	Движение.Скидка = Скидка;
	Движение.КоличествоПосещений = КоличествоПосещений;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
