
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
	// регистр Склады Расход
	Движения.Склады.Записывать = Истина;
	Для Каждого ТекСтрокаЗапасы Из Запасы Цикл
		Движение = Движения.Склады.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
		Движение.Дата = Дата;
		Движение.Количество = ТекСтрокаЗапасы.Количество;
		Движение.Сумма = ТекСтрокаЗапасы.Сумма;
	КонецЦикла;   

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

