&НаСервере
Функция ПолучитьПроцентСтавкиНДС(СтавкаНДС) Экспорт
	ПроцентыНДС = Новый Соответствие;
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18"), 18);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"), 0);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"), 20);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"), 0);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10"), 10);
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат ПроцентыНДС.Получить(СтавкаНДС);
	Иначе
		Возврат 0; 
	КонецЕсли;
КонецФункции