
&НаСервере
Процедура ЗапасыСуммаПриИзмененииНаСервере()
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
        СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	ЗапасыСуммаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	ЗапасыСуммаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	ЗапасыСуммаПриИзмененииНаСервере();
КонецПроцедуры




&НаСервере
Функция ПолучитьПроцентСтавкиНДС(СтавкаНДС) 
	ПроцентНДС = 0;
    
    Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
        ПроцентНДС = 18;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
        ПроцентНДС = 0;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
        ПроцентНДС = 20;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
        ПроцентНДС = 0;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
        ПроцентНДС = 10;
    КонецЕсли;
    
    Возврат ПроцентНДС;
КонецФункции


&НаСервере
Процедура ЗапасыСуммаНДСПриИзмененииНаСервере()
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
        СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;    
		ПроцентНДС = ПолучитьПроцентСтавкиНДС(СтрокаТЧ.НДС) / 100;
		СтрокаТЧ.СуммаНДС = СтрокаТЧ.Сумма * ПроцентНДС;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	ЗапасыСуммаНДСПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНДСПриИзменении(Элемент)
	ЗапасыСуммаНДСПриИзмененииНаСервере();
КонецПроцедуры



&НаСервере
Процедура ЗапасыПриИзмененииНаСервере()
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
        СтрокаТЧ.Всего = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	ЗапасыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


