
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Если Не Объект.Основание.Пустая() Тогда    
		Объект.Операция = ПредопределенноеЗначение("Перечисления.ВидыОпераций.ОплатаОтКлиента");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОперацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Объект.Основание.Пустая() Тогда         
		Если Объект.Операция = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента") Тогда
		   Сообщить("Вид операции «Оплата от клиента» и Способ оплаты «Оплата банковской картой» не доступны к выбору в документе «Поступление денежных средств», создаваемом пользователем самостоятельно.");
	   КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если Объект.Основание.Пустая() Тогда         
		Если Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособыОплаты.ОплатаБанковскойКартой") Тогда
			Сообщить("Вид операции «Оплата от клиента» и Способ оплаты «Оплата банковской картой» не доступны к выбору в документе «Поступление денежных средств», создаваемом пользователем самостоятельно.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


//&НаСервере
//Процедура ПриОткрытииНаСервере()
//	Если ЭтоНовый() Тогда
//	КонецЕсли;
//КонецПроцедуры


//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	ПриОткрытииНаСервере();
//КонецПроцедуры

