
// ++ SMPlekhanov@1bit.com 20.03.2024 [Самообучение]
// Проверка заполнения констант
Функция ПроверитьЗаполнениеКонстант() Экспорт  
	Возврат Не (Не ЗначениеЗаполнено(Константы.Адрес.Получить()) 
	Или Не ЗначениеЗаполнено(Константы.Валюта.Получить()) 
	Или Не ЗначениеЗаполнено(Константы.ИНН.Получить()) 
	Или Не ЗначениеЗаполнено(Константы.КПП.Получить()) 
	Или Не ЗначениеЗаполнено(Константы.Организация.Получить()) 
	Или Не ЗначениеЗаполнено(Константы.ОрганизацияНаименованиеПолное.Получить()));
КонецФункции
// -- SMPlekhanov@1bit.com 20.03.2024 [Самообучение]
